// Ref: https://github.com/shkarimpour/pholiday/blob/master/events/persian.js
export const persianEvents = {
  // farvardin // +0
  1: { title: 'جشن نوروز' },
  6: { title: 'روز امید / روز شادباش‌نویسی' },
  10: { title: 'جشن آبان‌گاه' },
  13: { title: 'جشن سیزده‌به‌در' },
  17: { title: 'سروش روز، جشن سروش‌گان' },
  19: { title: 'فروردین روز، جشن فروردین‌گان' },
  // ordibehesht // +31
  33: { title: 'جشن گیاه‌آوری' },
  34: { title: 'اردیبهشت روز، جشن اردیبهشت‌گان' },
  41: { title: 'جشن چهلم نوروز' },
  46: {
    title:
      'گاهنبار میدیوزَرِم، جشن میانه بهار، جشن بهاربد / روز پیام‌آوری زرتشت',
  },

  // khordad // +62
  63: { title: 'ارغاسوان، جشن گرما' },
  68: { title: 'خرداد روز، جشن خردادگان' },
  // tir // +93
  94: {
    title: 'جشن آب‌پاشونک، جشن آغاز تابستان / سال نو در گاهشماری گاهنباری',
  },

  99: { title: 'جشن نیلوفر' },
  106: { title: 'تیرروز، جشن تیرگان' },
  108: { title: 'جشن خام‌خواری' },
  // mordad // +124
  131: { title: 'مردادروز، جشن مردادگان' },
  134: { title: 'جشن چهلم تابستان' },
  139: { title: 'گاهنبار میدیوشِم، جشن میانه تابستان' },
  142: { title: 'جشن مَی‌خواره' },
  // shahrivar // +155
  156: { title: 'فغدیه، جشن خنکی هوا' },
  158: { title: 'جشن کشمین' },
  159: { title: 'شهریورروز، جشن شهریورگان / زادروز داراب (کوروش) / عروج مانی' },

  163: { title: 'خزان جشن' },
  170: { title: 'بازار جشن' },
  186: { title: 'گاهنبار پَتیَه‌شَهیم، جشن پایان تابستان' },

  // mehr // +186
  187: { title: 'جشن میتراکانا / سال نو هخامنشی' },
  195: { title: 'آیین قالیشویان اردهال، بازماندی از تیرگان' },

  199: { title: 'تیرروز، جشن تیرروزی' },
  202: { title: 'مهرروز، جشن مهرگان' },
  207: { title: 'رام روز، جشن رام روزی / جشن پیروزی کاوه و فریدون' },

  // aban // +216
  226: { title: 'آبان روز، جشن آبان‌گان' },
  231: { title: 'گاهنبار اَیاثرَم، جشن میانه پاییز' },
  // azar // +246
  247: { title: 'آذر جشن' },
  255: { title: 'آذر روز، جشن آذرگان' },
  276: {
    title:
      'جشن شب یلدا (چله) / گاهنبار میدیارِم، جشن میانه سال گاهنباری و پایان پاییز',
  },

  // dey // +276
  277: { title: 'روز میلاد خورشید، جشن خرم روز / نخستین جشن دی‌گان' },

  281: { title: 'بازار جشن' },
  284: { title: 'دی به آذر روز، دومین جشن دی‌گان' },
  290: { title: 'سیر روز، جشن گیاه‌خواری' },
  291: { title: 'جشن پیکرتراشی / دی به مهر روز، سومین جشن دی‌گان' },

  292: { title: 'جشن درامزینان، جشن درفش‌ها' },
  299: { title: 'دی به دین روز، چهارمین جشن دی‌گان' },
  // bahman // +306
  307: { title: 'زادروز فردوسی' },
  308: { title: 'بهمن روز، جشن بهمن‌گان' },
  310: { title: 'شهریور روز، آغاز پادشاهی داراب (کوروش)' },
  311: { title: 'جشن نوسَره' },
  316: {
    title: 'آبان روز، جشن سَدَه، آتش افروزی بر بام‌ها / نمایش بازی همگانی',
  },

  321: { title: 'جشن میانه زمستان' },
  328: { title: 'بادروز، جشن بادروزی' },
  // esfand // +336
  337: { title: 'جشن اسفندی / جشن آبسالان، بهار جشن / نمایش بازی همگانی' },

  341: {
    title: 'اسفند روز، جشن اسفندگان، گرامی‌داشت زمین و بانوان / جشن برزگران',
  },

  346: { title: 'جشن وخشنکام' },
  355: { title: 'جشن نوروز رودها' },
  356: { title: 'جشن گلدان' },
  361: { title: 'پایان سرایش شاهنامه فردوسی' },
  362: { title: 'فروردگان' },
  365: {
    title:
      'گاهنبار هَمَسپَتمَدَم، جشن پایان زمستان / زادروز زرتشت / جشن اوشیدر (نجات بخش ایرانی) در دریاچه هامون و کوه خواجه / آتش افروزی بر بام‌ها در استقبال از نوروز',
  },
};
